# RoofArea_Heated

## Description
Returns the heated (interior) area along the slope of roofs or roof faces  that meet the criteria.

```pascal
FUNCTION RoofArea_Heated(c : CRITERIA) : REAL;
```

```python

def vs.RoofArea_Heated(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA||

## Version
Availability: from Vectorworks 2009
## Category
* Criteria